In [1]:
import numpy as np
import pandas as pd

In [2]:
titanic_df = pd.read_csv("titanic.csv")
titanic_df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [3]:
titanic_df.shape

(1310, 14)

In [4]:
titanic_df.isna().sum()

pclass          1
survived        1
name            1
sex             1
age           264
sibsp           1
parch           1
ticket          1
fare            2
cabin        1015
embarked        3
boat          824
body         1189
home.dest     565
dtype: int64

In [5]:
titanic_df.dtypes

pclass       float64
survived     float64
name          object
sex           object
age          float64
sibsp        float64
parch        float64
ticket        object
fare         float64
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object

In [6]:
titanic_df.drop(["name","cabin","boat",'body','home.dest','ticket'] , axis = 1 , inplace=True)

In [7]:
titanic_df

      pclass  survived     sex      age  sibsp  parch      fare embarked
0        1.0       1.0  female  29.0000    0.0    0.0  211.3375        S
1        1.0       1.0    male   0.9167    1.0    2.0  151.5500        S
2        1.0       0.0  female   2.0000    1.0    2.0  151.5500        S
3        1.0       0.0    male  30.0000    1.0    2.0  151.5500        S
4        1.0       0.0  female  25.0000    1.0    2.0  151.5500        S
...      ...       ...     ...      ...    ...    ...       ...      ...
1305     3.0       0.0  female      NaN    1.0    0.0   14.4542        C
1306     3.0       0.0    male  26.5000    0.0    0.0    7.2250        C
1307     3.0       0.0    male  27.0000    0.0    0.0    7.2250        C
1308     3.0       0.0    male  29.0000    0.0    0.0    7.8750        S
1309     NaN       NaN     NaN      NaN    NaN    NaN       NaN      NaN

[1310 rows x 8 columns]

In [8]:
titanic_df.age.fillna(titanic_df.age.median(), inplace=True) # We filled nans with median.

In [9]:
titanic_df.isna().sum()

pclass      1
survived    1
sex         1
age         0
sibsp       1
parch       1
fare        2
embarked    3
dtype: int64

In [10]:
titanic_df.dropna(inplace=True)

In [11]:
titanic_df.isna().sum() # Clear now.

pclass      0
survived    0
sex         0
age         0
sibsp       0
parch       0
fare        0
embarked    0
dtype: int64

In [12]:
titanic_df.dtypes

pclass      float64
survived    float64
sex          object
age         float64
sibsp       float64
parch       float64
fare        float64
embarked     object
dtype: object

In [13]:
sex = pd.get_dummies(titanic_df["sex"])
embarked = pd.get_dummies(titanic_df["embarked"])

In [14]:
titanic_df.drop(["sex",'embarked'], axis = 1 , inplace=True)

In [15]:
titanic_df = pd.concat([titanic_df,sex,embarked] , axis = 1)

In [16]:
titanic_df

      pclass  survived      age  sibsp  parch      fare  female  male  C  Q  S
0        1.0       1.0  29.0000    0.0    0.0  211.3375       1     0  0  0  1
1        1.0       1.0   0.9167    1.0    2.0  151.5500       0     1  0  0  1
2        1.0       0.0   2.0000    1.0    2.0  151.5500       1     0  0  0  1
3        1.0       0.0  30.0000    1.0    2.0  151.5500       0     1  0  0  1
4        1.0       0.0  25.0000    1.0    2.0  151.5500       1     0  0  0  1
...      ...       ...      ...    ...    ...       ...     ...   ... .. .. ..
1304     3.0       0.0  14.5000    1.0    0.0   14.4542       1     0  1  0  0
1305     3.0       0.0  28.0000    1.0    0.0   14.4542       1     0  1  0  0
1306     3.0       0.0  26.5000    0.0    0.0    7.2250       0     1  1  0  0
1307     3.0       0.0  27.0000    0.0    0.0    7.2250       0     1  1  0  0
1308     3.0       0.0  29.0000    0.0    0.0    7.8750       0     1  0  0  1

[1306 rows x 11 columns]

In [17]:
titanic_df.dtypes

pclass      float64
survived    float64
age         float64
sibsp       float64
parch       float64
fare        float64
female        uint8
male          uint8
C             uint8
Q             uint8
S             uint8
dtype: object

In [18]:
from sklearn.model_selection import train_test_split

In [19]:
X = titanic_df.drop("survived" , axis = 1)
y = titanic_df["survived"]

In [20]:
X_train, X_test , y_train, y_test = train_test_split(X,y, random_state = 5)

In [21]:
from sklearn.linear_model import LogisticRegression

In [22]:
lr = LogisticRegression(max_iter=1000).fit(X_train,y_train)

In [23]:
lr.score(X_test,y_test)

0.8256880733944955

In [24]:
lr.score(X_train,y_train)

0.7834525025536262